{
    "permutation_data": {
        "start": [
            "2018-08-27T04:00:00Z",
            "2017-03-06T05:00:00Z",
            null
        ],
        "end": [
            "2018-10-30T00:00:00Z",
            "2017-01-31T00:00:00Z",
            null
        ],
        "seats": [
            {
                "type": "honor",
                "price": "0.00",
                "currency": "USD",
                "upgrade_deadline": null,
                "sku": "B35FAFB"
            },
            {
                "type": "audit",
                "price": "0.00",
                "currency": "USD",
                "upgrade_deadline": null,
                "sku": "7B55983"
            },
            {
                "type": "verified",
                "price": "150.00",
                "currency": "USD",
                "upgrade_deadline": "2018-02-27T23:59:00Z",
                "sku": "DCC54AA"
            },
            {
                "type": "credit",
                "price": "600.00",
                "currency": "USD",
                "upgrade_deadline": "2017-01-10T00:00:00Z",
                "sku": "E29ADD9"
            },
            {
                "type": null,
                "price": null,
                "currency": null,
                "upgrade_deadline": null,
                "sku": null
            }
        ],
        "availability": [
            "Current",
            "Starting Soon",
            "Upcoming",
            null
        ],
        "title": [
            "International Project Management",
            "Cybersecurity Fundamentals",
            "",
            null
        ],
        "short_description": [
            "Demonstrate the knowledge and skills acquired in the Cybersecurity MicroMasters Program.",
            "Learn about the evolution of video games from experts.",
            "",
            null
        ],
        "full_description": [
            "<p>Learn about project management from a multidisciplinary perspective, as we cover fundamental tools and techniques for managing a broad range of projects.</p>\n<p>You will learn about the project management life cycle from initiation to closing. We will address the behavioral and quantitative facets of project management, as well as the use of methods, tools and techniques for the initiation, planning, execution and closing of projects. The course will be divided by the project life cycle phases.</p>\n<p>First, we will cover project initiation. We will review projects in organizations, project selection models, the project manager role and project organization structures to better understand how a project is initiated. You will also learn how to create a key project management deliverable, the project charter.</p>\n<p>Second, we will cover the project-planning phase. You will learn how to build a comprehensive project management plan covering the key aspects of risk, quality, scope, schedule, cost, time, resource and communications.</p>\n<p>Third, we will cover the project execution phase. We will explore the monitoring and control of a project including earned value analysis and project reporting. Case studies and examples will be used to help you understand the correct actions for a project manager to take to keep a project in control.</p>\n<p>Finally, we will cover the project closing phase, where we explore the tasks to complete an effective project closure.</p>\n<p>This course is part of the RIT Project Management MicroMasters Program that is designed to teach the skills and behaviors necessary to be successful in a project management career. In order to qualify for the MicroMasters Credential, you will need to earn a verified certificate in each of the three courses as well as pass a capstone exam.</p>",
            "<p>In this introduction to the field of computing security, you will be given an extensive overview of the various branches of computing security. You will learn cybersecurity concepts, issues, and tools that are critical in solving problems in the computing security domain.</p>\n<p>You will have opportunities to learn essential techniques in protecting systems and network infrastructures, analyzing and monitoring potential threats and attacks, devising and implementing security solutions for organizations large or small.</p>\n<p>This offering is part of the RITx Cybersecurity MicroMasters Program that prepares students to enter and advance in the field of computing security.</p>",
            "",
            null
        ],
        "image": [
            {
                "src": "https://www.edx.org/sites/default/files/course/image/featured-card/best_practice_318x210.jpg",
                "description": null,
                "height": null,
                "width": null
            },
            {
                "width": null,
                "height": null,
                "src": "https://www.edx.org/sites/default/files/course/image/promoted/international_project_378x225.jpg",
                "description": null
            },
            {
                "src": null,
                "height": null,
                "width": null,
                "description": null
            }
        ],
        "pacing_type": [
            "instructor_paced",
            "self_paced",
            null
        ],
        "marketing_url": [
            "https://www.edx.org/course/ritxpm9001x",
            "https://www.edx.org/course/cybersecurity-capstone-ritx-cyber525x",
            "",
            null
        ],
        "mobile_available": [
            true,
            false,
            null
        ],
        "content_language": [
            "en-us",
            "zh-cmn",
            "",
            null
        ]
    },
    "default_data": {
        "start": "2018-08-27T04:00:00Z",
        "end": "2018-10-30T00:00:00Z",
        "seats": [
            {
                "type": "audit",
                "price": "0.00",
                "currency": "USD",
                "upgrade_deadline": null,
                "sku": "3CC0AEC"
            },
            {
                "type": "verified",
                "price": "150.00",
                "currency": "USD",
                "upgrade_deadline": "2018-10-01T23:59:00Z",
                "sku": "9B36778"
            }
        ],
        "availability": "Upcoming",
        "key": "course-v1:RITx+PM9003x+2T2018_2",
        "title": "International Project Management",
        "short_description": "Learn what makes global projects uniquely challenging and how to successfully manage projects based in different industries and countries.",
        "full_description": "<p>Managing global projects presents unique challenges. This course addresses the knowledge, skills and behaviors required to successfully manage projects that span organizations, national boundaries and cultural differences.</p>\n<p>In this course we will explore the impact on project management of culture, language variations, religious, regulatory and legal practices, technology penetration, temporal orientation, gender issues, corruption, ethics, personal liberty and political contexts. We learn how to meet global projects challenges through efficient use of practices and technology. The course will utilize available case studies and examples from companies to help students sharpen the skills needed to recognize and foster a successful international project environment.</p>\n<p>First, you will learn how culture affects how teams perceive each other, lead, solve problems and execute tasks. Although the world is increasingly connected, the people behind the projects have biases, expectations and a perception of life that impacts all decisions.</p>\n<p>Second, you will learn how to effectively manage global teams including how to build trust and collaboration across various cultures, time zones and technological settings. You will learn how to design communication channels and project structures effectively in a global project environment.</p>\n<p>Third, you will become familiar with the issues underlying the problem of corruption, which is the abuse of trusted power for private gain. Reducing the risk of corruption strengthens a company’s reputation, builds the respect of employees and raises credibility with key stakeholders.</p>\n<p>Finally, you will learn how the adoption of collaboration tools can enhance the global project experience.</p>\n<p>This course is part of the RIT Project Management MicroMasters Program that is designed to teach how to successfully deliver projects in an international environment. In order to qualify for the MicroMasters Credential, you will need to earn a verified certificate in each of the three courses as well as pass a capstone exam.</p>",
        "image": {
            "width": null,
            "height": null,
            "src": "https://www.edx.org/sites/default/files/course/image/promoted/international_project_378x225.jpg",
            "description": null
        },
        "pacing_type": "instructor_paced",
        "marketing_url": "https://www.edx.org/course/international-project-management-ritx-pm9003x-1",
        "mobile_available": true,
        "content_language": "en-us"
    }
}
